app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all.order(created_at: :desc)
---
SELECT "tweeets".* FROM "tweeets" ORDER BY "tweeets"."created_at" DESC

  def create
    @tweeet = Tweeet.new(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tweeet", "This is my first tweet..."], ["created_at", "2021-06-21 16:55:35.031436"], ["updated_at", "2021-06-21 16:55:35.031436"]]

  def update
    respond_to do |format|
      if @tweeet.update(tweeet_params)
---
UPDATE "tweeets" SET "tweeet" = $1, "updated_at" = $2 WHERE "tweeets"."id" = $3  [["tweeet", "This is my first tweet...\r\nYah!"], ["updated_at", "2021-06-21 16:55:47.294839"], ["id", 1]]

    def set_tweeet
      @tweeet = Tweeet.find(params[:id])
---
SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]